#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-006f6db6a24356739]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-08ad602944b29d19c]
module.ecr-bot-server.aws_ecr_repository.main: Refreshing state... [id=line-bot-sample2-bot-server]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0f4ea87184c0c52ae]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-00c1771ebed56d7c3]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-03b3ab2a2914b0263]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-057efc7729a90543c]
module.vpc.aws_route.privates[1]: Refreshing state... [id=r-rtb-0a31ed301afa10c9e1080289494]
module.vpc.aws_route.privates[0]: Refreshing state... [id=r-rtb-0b7249501f7f39f801080289494]
module.vpc.aws_route.privates[2]: Refreshing state... [id=r-rtb-0f70a7f400318b4fa1080289494]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:cluster/line-bot-sample2]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0b9c9dcab97f3491c]
module.ecr-app.aws_ecr_repository.main: Refreshing state... [id=line-bot-sample2-app]
module.route53.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:554506578892:certificate/06e7b54e-fc23-4c2b-8939-aabde5bbb683]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=EcsTaskRole-line-bot-sample2]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy_for_ecr: Refreshing state... [id=EcsTaskRole-line-bot-sample2-20210429021106029600000001]
module.ecs.aws_ecs_task_definition.main: Refreshing state... [id=line-bot-sample2-task-definition]
module.route53.aws_route53_record.validations["line-bot-sample2.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__9423f2f8b78ae3bdeb3548f1bea69efa.line-bot-sample2.moikilo00.net._CNAME]
module.route53.aws_acm_certificate_validation.main: Refreshing state... [id=2021-04-27 09:08:01 +0000 UTC]
module.vpc.aws_subnet.publics[1]: Refreshing state... [id=subnet-0a3c585bbf6bba58b]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0833e5cbb3feed7c4]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0db9d7fef1d452a9f]
module.vpc.aws_route_table.privates[2]: Refreshing state... [id=rtb-0f70a7f400318b4fa]
module.ecs.aws_security_group.ecs: Refreshing state... [id=sg-071dd337cfbbbb50d]
module.vpc.aws_subnet.publics[0]: Refreshing state... [id=subnet-0bb63a2f82ac5687b]
module.vpc.aws_route_table.privates[0]: Refreshing state... [id=rtb-0b7249501f7f39f80]
module.vpc.aws_subnet.publics[2]: Refreshing state... [id=subnet-03c288199d18a8e45]
module.vpc.aws_route_table.privates[1]: Refreshing state... [id=rtb-0a31ed301afa10c9e]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/line-bot-sample2-target-group/85c2e8b8911549f7]
module.vpc.aws_subnet.privates[0]: Refreshing state... [id=subnet-0d00944d99dfe3fb9]
module.vpc.aws_subnet.privates[1]: Refreshing state... [id=subnet-071a11b51c485b0b1]
module.vpc.aws_subnet.privates[2]: Refreshing state... [id=subnet-02c271aaae088ea4b]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-0829c8222f3c2e3f0]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-0833e5cbb3feed7c41080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05e859eb1301e09d1]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f51279304586a58e]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dfdb12fab7d4006a]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/line-bot-sample2/2d23d36ec59ecb9b]
module.vpc.aws_route_table_association.privates[0]: Refreshing state... [id=rtbassoc-0840d58339cd83f90]
module.vpc.aws_route_table_association.privates[1]: Refreshing state... [id=rtbassoc-0a74d87da37cd4c32]
module.vpc.aws_route_table_association.privates[2]: Refreshing state... [id=rtbassoc-0c7b9baba708642b6]
module.ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:554506578892:service/line-bot-sample2/line-bot-sample2]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/2d23d36ec59ecb9b/f629bb67277bf261]
module.alb.aws_lb_listener.http_to_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/line-bot-sample2/2d23d36ec59ecb9b/cb9619fbb54169cb]
module.route53.aws_route53_record.main: Refreshing state... [id=Z04052072YGY8CIREK2A2_line-bot-sample2.moikilo00.net_A]
module.alb.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener-rule/app/line-bot-sample2/2d23d36ec59ecb9b/f629bb67277bf261/d135b6a132b7b048]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.ecr-app.aws_security_group.vpc_endpoint will be created
  + resource "aws_security_group" "vpc_endpoint" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "vpc_endpoint_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-0b9c9dcab97f3491c"
    }

  # module.ecr-app.aws_vpc_endpoint.ecr_api will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-02c271aaae088ea4b",
          + "subnet-071a11b51c485b0b1",
          + "subnet-0d00944d99dfe3fb9",
        ]
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0b9c9dcab97f3491c"
    }

  # module.ecr-app.aws_vpc_endpoint.ecr_dkr will be created
  + resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-02c271aaae088ea4b",
          + "subnet-071a11b51c485b0b1",
          + "subnet-0d00944d99dfe3fb9",
        ]
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0b9c9dcab97f3491c"
    }

  # module.ecr-bot-server.aws_ecr_repository.main will be destroyed
  - resource "aws_ecr_repository" "main" {
      - arn                  = "arn:aws:ecr:ap-northeast-1:554506578892:repository/line-bot-sample2-bot-server" -> null
      - id                   = "line-bot-sample2-bot-server" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "line-bot-sample2-bot-server" -> null
      - registry_id          = "554506578892" -> null
      - repository_url       = "554506578892.dkr.ecr.ap-northeast-1.amazonaws.com/line-bot-sample2-bot-server" -> null
      - tags                 = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # module.vpc.aws_eip.nat[0] will be destroyed
  - resource "aws_eip" "nat" {
      - association_id       = "eipassoc-023d6b36381b5eb77" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-057efc7729a90543c" -> null
      - network_border_group = "ap-northeast-1" -> null
      - network_interface    = "eni-06052df6cfc1b227c" -> null
      - private_dns          = "ip-10-0-0-108.ap-northeast-1.compute.internal" -> null
      - private_ip           = "10.0.0.108" -> null
      - public_dns           = "ec2-35-73-205-197.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip            = "35.73.205.197" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "line-bot-sample2-natgw-0"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_eip.nat[1] will be destroyed
  - resource "aws_eip" "nat" {
      - association_id       = "eipassoc-05b38b26a66887438" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-00c1771ebed56d7c3" -> null
      - network_border_group = "ap-northeast-1" -> null
      - network_interface    = "eni-0bca07145dbf4f909" -> null
      - private_dns          = "ip-10-0-1-241.ap-northeast-1.compute.internal" -> null
      - private_ip           = "10.0.1.241" -> null
      - public_dns           = "ec2-18-178-194-211.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip            = "18.178.194.211" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "line-bot-sample2-natgw-1"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_eip.nat[2] will be destroyed
  - resource "aws_eip" "nat" {
      - association_id       = "eipassoc-0b0f3252e325f2667" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-006f6db6a24356739" -> null
      - network_border_group = "ap-northeast-1" -> null
      - network_interface    = "eni-08cad9f31c345c39b" -> null
      - private_dns          = "ip-10-0-2-227.ap-northeast-1.compute.internal" -> null
      - private_ip           = "10.0.2.227" -> null
      - public_dns           = "ec2-52-192-246-10.ap-northeast-1.compute.amazonaws.com" -> null
      - public_ip            = "52.192.246.10" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "line-bot-sample2-natgw-2"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_nat_gateway.this[0] will be destroyed
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-057efc7729a90543c" -> null
      - id                   = "nat-08ad602944b29d19c" -> null
      - network_interface_id = "eni-06052df6cfc1b227c" -> null
      - private_ip           = "10.0.0.108" -> null
      - public_ip            = "35.73.205.197" -> null
      - subnet_id            = "subnet-0bb63a2f82ac5687b" -> null
      - tags                 = {
          - "Name" = "line-bot-sample2-0"
        } -> null
    }

  # module.vpc.aws_nat_gateway.this[1] will be destroyed
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-00c1771ebed56d7c3" -> null
      - id                   = "nat-0f4ea87184c0c52ae" -> null
      - network_interface_id = "eni-0bca07145dbf4f909" -> null
      - private_ip           = "10.0.1.241" -> null
      - public_ip            = "18.178.194.211" -> null
      - subnet_id            = "subnet-0a3c585bbf6bba58b" -> null
      - tags                 = {
          - "Name" = "line-bot-sample2-1"
        } -> null
    }

  # module.vpc.aws_nat_gateway.this[2] will be destroyed
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-006f6db6a24356739" -> null
      - id                   = "nat-03b3ab2a2914b0263" -> null
      - network_interface_id = "eni-08cad9f31c345c39b" -> null
      - private_ip           = "10.0.2.227" -> null
      - public_ip            = "52.192.246.10" -> null
      - subnet_id            = "subnet-03c288199d18a8e45" -> null
      - tags                 = {
          - "Name" = "line-bot-sample2-2"
        } -> null
    }

  # module.vpc.aws_route.privates[0] will be destroyed
  - resource "aws_route" "privates" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0b7249501f7f39f801080289494" -> null
      - nat_gateway_id         = "nat-08ad602944b29d19c" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0b7249501f7f39f80" -> null
      - state                  = "active" -> null
    }

  # module.vpc.aws_route.privates[1] will be destroyed
  - resource "aws_route" "privates" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0a31ed301afa10c9e1080289494" -> null
      - nat_gateway_id         = "nat-0f4ea87184c0c52ae" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0a31ed301afa10c9e" -> null
      - state                  = "active" -> null
    }

  # module.vpc.aws_route.privates[2] will be destroyed
  - resource "aws_route" "privates" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0f70a7f400318b4fa1080289494" -> null
      - nat_gateway_id         = "nat-03b3ab2a2914b0263" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0f70a7f400318b4fa" -> null
      - state                  = "active" -> null
    }

Plan: 3 to add, 0 to change, 10 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @lazmond3, Action: `pull_request`*